In [1]:
# Import intial Libererises
import pandas as pd
import numpy as np

In [2]:
# Read the Csv file
data = pd.read_csv("1000 records.csv")

<h3>Q1: Which month saw the highest joining of the employees</h3>

In [4]:
df1 = data.groupby(by=['Month Name of Joining'], as_index=False)['Emp ID'].count()
df1.iloc[d11['Emp ID'].idxmax()]

Month Name of Joining    April
Emp ID                     107
Name: 0, dtype: object

<h3>Question 2: Which Region has highest mean salary</h3>

In [7]:
df2 = data.groupby(by=['State'], as_index=False)['Salary'].mean()
df2.max()

State         WY
Salary    168548
dtype: object

<h3>Question 3: Which region has lowest mean salary</h3>

In [9]:
df2.min()

State          AK
Salary    81371.3
dtype: object

<h3>Question: 4 Which City has highest mean weight </h3>

In [10]:
df3 = data.groupby(by=['City'], as_index=False)['Weight in Kgs.'].mean()
df3.max()

City              Zephyrhills
Weight in Kgs.             90
dtype: object

<h3>Question: 5 What is the difference between mean salary of Doctors and Professors</h3>

In [11]:
df4 = data.groupby(by=['Name Prefix'], as_index=False)['Salary'].mean()

In [13]:
doctor = df4.loc[df4['Name Prefix'] == 'Dr.'].Salary
prof = df4.loc[df4['Name Prefix'] == 'Prof.'].Salary

Difference = float(prof) - float(doctor) 
Difference

6500.446180555562

<h3>Question:6 How many female use gmail </h3>

In [19]:
# Splitting Emails from @ Symbol and make them seperate into two coloums
df5 = data['E Mail'].str.split("@", n = 1, expand = True)
df5

                     0              1
0          shawna.buck      gmail.com
1      nathaniel.burke    walmart.com
2     elisabeth.foster      gmail.com
3     briana.lancaster      yahoo.com
4       estella.potter      gmail.com
..                 ...            ...
995       bonnie.baker         bp.com
996        luke.turner    charter.net
997         eva.holman    hotmail.com
998  maritza.christian  microsoft.com
999     phyllis.dudley    yahoo.co.in

[1000 rows x 2 columns]

In [28]:
# Splitting Emails from . Symbol and make them seperate into two coloums
df6 = df5[1].str.split(".", n = 1, expand = True)

In [29]:
df6

             0      1
0        gmail    com
1      walmart    com
2        gmail    com
3        yahoo    com
4        gmail    com
..         ...    ...
995         bp    com
996    charter    net
997    hotmail    com
998  microsoft    com
999      yahoo  co.in

[1000 rows x 2 columns]

In [30]:
# Append Columns 0 into our data and label colums with name emails_platform...

data['emails_platform']= df6[0]

In [31]:
get_gmail_femail = data.loc[(data['Gender'] == 'F' )& (data['emails_platform'] == 'gmail')]
get_gmail_femail.shape[0]

161

<h3>Question:7 How many Doctors use yahoo </h3>

In [33]:
get_doctors_yahoo = data.loc[(data['Name Prefix'] == 'Dr.' ) & (data['emails_platform'] == 'yahoo')]
get_doctors_yahoo.shape[0]

7

<h3>Question:8 Which profession had the lowest % mean hike</h3>

In [39]:
# Similary as before Splitting Last % Hike % Symbol and make them seperate into two coloums
Last_Hike = data['Last % Hike'].str.split("%", n = 1, expand = True)
data['Last % Hike1']= Last_Hike[0].astype(int)
df7 = data.groupby(by=['Name Prefix'], as_index=False)['Last % Hike1'].mean()
df7.min()

Name Prefix         Dr.
Last % Hike1    12.6724
dtype: object